module.exports = router => {  //获取当前季度卖货情况接口

    const code = 200

    router.get('/getCurrentSoldInfo', async(ctx) => {
        if (code === 200) {  
            ctx.body = {
                code: 200,
                message: '获取当前季度卖货情况成功',
                    data: {
                        simple_today: 333,  //简约版今日销售数量
                        hard_today: 666,  //精装版今日销售数量
                        old_today: 999,  //老人版今日销售数量
                        simple_week: 333,  //简约版本周销售数量
                        hard_week: 666,  //精装版本周销售数量
                        old_week: 999,  //老人版本周销售数量
                        sold_data: {
                            categories: ['9/1', '9/2', '9/3', '9/4', '9/5', '9/6', '9/7', '9/8', '9/9', '9/10', '9/11', '9/12', '9/13', '9/14', '9/15', '9/16', '9/17', '9/18', '9/19'],
                            series: [
                                {
                                    name: '精装版',
                                    data: [350, 360, 310, 330, 130, 340, 330, 290, 350, 360, 310, 330, 130, 340, 330, 290, 489, 290, 350, 360]
                                },
                                {
                                    name: '简约版',
                                    data: [180, 270, 210, 240, 60, 280, 300, 270, 180, 270, 210, 240, 60, 280, 300, 270, 270, 210, 240, 280]
                                },
                                {
                                    name: '老人版',
                                    data: [180, 270, 210, 240, 60, 280, 400, 360, 180, 270, 210, 240, 60, 280, 400, 360, 280, 400, 360, 456]
                                },
                            ]
                        }
                }
            }
        } else if (code === 300) {  //否则
            ctx.body = {
                code: 300,
                message: '获取当前季度卖货情况失败',
                data: {
                    
                }
            }
        }
    })

}